Tekla.Structures.CatalogInternal.ImportEntryType
The import entry type.

Tekla.Structures.CatalogInternal.ImportEntryType.Metadata
The metadata as entry.

Tekla.Structures.CatalogInternal.ImportEntryType.Geometry
The geometry as entry.

Tekla.Structures.CatalogInternal.ImportEntryType.NativeArchive
The native archive as entry.